Revit 2027 API
PointOnPlane.Offset Property
Signed offset from the plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Offset { get; set; }
Public Property Offset As Double
	Get
	Set
public:
property double Offset {
	double get ();
	void set (double value);
}
member Offset : float with get, set
Property Value
Double
Remarks
The point's position is offset in the direction of the normal vector returned by the Plane.Normal property.
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace